Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hefc.h
/* -------- HEFC_FSR : (HEFC Offset: 0x08) ( R/ 32) HEFC Flash Status Register -------- */
#define HEFC_FSR_FRDY_Pos                     _UINT32_(0)                                          /* (HEFC_FSR) Flash Ready Status (cleared when Flash is busy) Position */
#define HEFC_FSR_FRDY_Msk                     (_UINT32_(0x1) << HEFC_FSR_FRDY_Pos)                 /* (HEFC_FSR) Flash Ready Status (cleared when Flash is busy) Mask */
#define HEFC_FSR_FRDY(value)                  (HEFC_FSR_FRDY_Msk & (_UINT32_(value) << HEFC_FSR_FRDY_Pos)) /* Assigment of value for FRDY in the HEFC_FSR register */
#define HEFC_FSR_FCMDE_Pos                    _UINT32_(1)                                          /* (HEFC_FSR) Flash Command Error Status (cleared on read or by writing HEFC_FCR) Position */
#define HEFC_FSR_FCMDE_Msk                    (_UINT32_(0x1) << HEFC_FSR_FCMDE_Pos)                /* (HEFC_FSR) Flash Command Error Status (cleared on read or by writing HEFC_FCR) Mask */
#define HEFC_FSR_FCMDE(value)                 (HEFC_FSR_FCMDE_Msk & (_UINT32_(value) << HEFC_FSR_FCMDE_Pos)) /* Assigment of value for FCMDE in the HEFC_FSR register */
#define HEFC_FSR_FLOCKE_Pos                   _UINT32_(2)                                          /* (HEFC_FSR) Flash Lock Error Status (cleared on read) Position */
#define HEFC_FSR_FLOCKE_Msk                   (_UINT32_(0x1) << HEFC_FSR_FLOCKE_Pos)               /* (HEFC_FSR) Flash Lock Error Status (cleared on read) Mask */
#define HEFC_FSR_FLOCKE(value)                (HEFC_FSR_FLOCKE_Msk & (_UINT32_(value) << HEFC_FSR_FLOCKE_Pos)) /* Assigment of value for FLOCKE in the HEFC_FSR register */
#define HEFC_FSR_WREER_Pos                    _UINT32_(4)                                          /* (HEFC_FSR) Write Register Error Status (cleared on read) Position */
#define HEFC_FSR_WREER_Msk                    (_UINT32_(0x1) << HEFC_FSR_WREER_Pos)                /* (HEFC_FSR) Write Register Error Status (cleared on read) Mask */
#define HEFC_FSR_WREER(value)                 (HEFC_FSR_WREER_Msk & (_UINT32_(value) << HEFC_FSR_WREER_Pos)) /* Assigment of value for WREER in the HEFC_FSR register */
#define HEFC_FSR_Msk                          _UINT32_(0x00000017)                                 /* (HEFC_FSR) Register Mask  */


/* -------- HEFC_FRR : (HEFC Offset: 0x0C) ( R/ 32) HEFC Flash Result Register -------- */
#define HEFC_FRR_FVALUE_Pos                   _UINT32_(0)                                          /* (HEFC_FRR) Flash Result Value Position */
#define HEFC_FRR_FVALUE_Msk                   (_UINT32_(0xFFFFFFFF) << HEFC_FRR_FVALUE_Pos)        /* (HEFC_FRR) Flash Result Value Mask */
#define HEFC_FRR_FVALUE(value)                (HEFC_FRR_FVALUE_Msk & (_UINT32_(value) << HEFC_FRR_FVALUE_Pos)) /* Assigment of value for FVALUE in the HEFC_FRR register */
#define HEFC_FRR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (HEFC_FRR) Register Mask  */


/* -------- HEFC_FPMR : (HEFC Offset: 0x40) (R/W 32) HEFC Flash Power Management Register -------- */
#define HEFC_FPMR_PWS_EN_Pos                  _UINT32_(0)                                          /* (HEFC_FPMR) Power switch enable Position */
#define HEFC_FPMR_PWS_EN_Msk                  (_UINT32_(0x1) << HEFC_FPMR_PWS_EN_Pos)              /* (HEFC_FPMR) Power switch enable Mask */
#define HEFC_FPMR_PWS_EN(value)               (HEFC_FPMR_PWS_EN_Msk & (_UINT32_(value) << HEFC_FPMR_PWS_EN_Pos)) /* Assigment of value for PWS_EN in the HEFC_FPMR register */
#define HEFC_FPMR_PWS_STAT_Pos                _UINT32_(1)                                          /* (HEFC_FPMR) Power switch Status Position */
#define HEFC_FPMR_PWS_STAT_Msk                (_UINT32_(0x1) << HEFC_FPMR_PWS_STAT_Pos)            /* (HEFC_FPMR) Power switch Status Mask */
#define HEFC_FPMR_PWS_STAT(value)             (HEFC_FPMR_PWS_STAT_Msk & (_UINT32_(value) << HEFC_FPMR_PWS_STAT_Pos)) /* Assigment of value for PWS_STAT in the HEFC_FPMR register */
#define HEFC_FPMR_PWS_DLY_Pos                 _UINT32_(2)                                          /* (HEFC_FPMR) Power switch Delay Position */
#define HEFC_FPMR_PWS_DLY_Msk                 (_UINT32_(0x3) << HEFC_FPMR_PWS_DLY_Pos)             /* (HEFC_FPMR) Power switch Delay Mask */
#define HEFC_FPMR_PWS_DLY(value)              (HEFC_FPMR_PWS_DLY_Msk & (_UINT32_(value) << HEFC_FPMR_PWS_DLY_Pos)) /* Assigment of value for PWS_DLY in the HEFC_FPMR register */
#define   HEFC_FPMR_PWS_DLY_75US_Val          _UINT32_(0x0)                                        /* (HEFC_FPMR) delay is set to 75 usec  */
#define   HEFC_FPMR_PWS_DLY_150US_Val         _UINT32_(0x1)                                        /* (HEFC_FPMR) delay is set to 150 usec  */
#define   HEFC_FPMR_PWS_DLY_300US_Val         _UINT32_(0x2)                                        /* (HEFC_FPMR) delay is set to 300 usec  */
#define   HEFC_FPMR_PWS_DLY_600US_Val         _UINT32_(0x3)                                        /* (HEFC_FPMR) delay is set to 600 usec  */
#define HEFC_FPMR_PWS_DLY_75US                (HEFC_FPMR_PWS_DLY_75US_Val << HEFC_FPMR_PWS_DLY_Pos) /* (HEFC_FPMR) delay is set to 75 usec Position  */
#define HEFC_FPMR_PWS_DLY_150US               (HEFC_FPMR_PWS_DLY_150US_Val << HEFC_FPMR_PWS_DLY_Pos) /* (HEFC_FPMR) delay is set to 150 usec Position  */
#define HEFC_FPMR_PWS_DLY_300US               (HEFC_FPMR_PWS_DLY_300US_Val << HEFC_FPMR_PWS_DLY_Pos) /* (HEFC_FPMR) delay is set to 300 usec Position  */
#define HEFC_FPMR_PWS_DLY_600US               (HEFC_FPMR_PWS_DLY_600US_Val << HEFC_FPMR_PWS_DLY_Pos) /* (HEFC_FPMR) delay is set to 600 usec Position  */
#define HEFC_FPMR_VAR_FACTOR_Pos              _UINT32_(8)                                          /* (HEFC_FPMR) Variation Factor Position */
#define HEFC_FPMR_VAR_FACTOR_Msk              (_UINT32_(0x3F) << HEFC_FPMR_VAR_FACTOR_Pos)         /* (HEFC_FPMR) Variation Factor Mask */
#define HEFC_FPMR_VAR_FACTOR(value)           (HEFC_FPMR_VAR_FACTOR_Msk & (_UINT32_(value) << HEFC_FPMR_VAR_FACTOR_Pos)) /* Assigment of value for VAR_FACTOR in the HEFC_FPMR register */
#define HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos        _UINT32_(16)                                         /* (HEFC_FPMR) Flash insulated Control Status Position */
#define HEFC_FPMR_FUNC_ISOL_CTRL_N_Msk        (_UINT32_(0x1) << HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos)    /* (HEFC_FPMR) Flash insulated Control Status Mask */
#define HEFC_FPMR_FUNC_ISOL_CTRL_N(value)     (HEFC_FPMR_FUNC_ISOL_CTRL_N_Msk & (_UINT32_(value) << HEFC_FPMR_FUNC_ISOL_CTRL_N_Pos)) /* Assigment of value for FUNC_ISOL_CTRL_N in the HEFC_FPMR register */
#define HEFC_FPMR_Msk                         _UINT32_(0x00013F0F)                                 /* (HEFC_FPMR) Register Mask  */


/* -------- HEFC_WPMR : (HEFC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define HEFC_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (HEFC_WPMR) Write Protection Enable Position */
#define HEFC_WPMR_WPEN_Msk                    (_UINT32_(0x1) << HEFC_WPMR_WPEN_Pos)                /* (HEFC_WPMR) Write Protection Enable Mask */
#define HEFC_WPMR_WPEN(value)                 (HEFC_WPMR_WPEN_Msk & (_UINT32_(value) << HEFC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the HEFC_WPMR register */
#define HEFC_WPMR_GPNVMWP_Pos                 _UINT32_(1)                                          /* (HEFC_WPMR) GPNVM Bit Write Protection Position */
#define HEFC_WPMR_GPNVMWP_Msk                 (_UINT32_(0x1) << HEFC_WPMR_GPNVMWP_Pos)             /* (HEFC_WPMR) GPNVM Bit Write Protection Mask */
#define HEFC_WPMR_GPNVMWP(value)              (HEFC_WPMR_GPNVMWP_Msk & (_UINT32_(value) << HEFC_WPMR_GPNVMWP_Pos)) /* Assigment of value for GPNVMWP in the HEFC_WPMR register */
#define HEFC_WPMR_LOCKWP_Pos                  _UINT32_(2)                                          /* (HEFC_WPMR) Lock Bit Write Protection Position */
#define HEFC_WPMR_LOCKWP_Msk                  (_UINT32_(0x1) << HEFC_WPMR_LOCKWP_Pos)              /* (HEFC_WPMR) Lock Bit Write Protection Mask */
#define HEFC_WPMR_LOCKWP(value)               (HEFC_WPMR_LOCKWP_Msk & (_UINT32_(value) << HEFC_WPMR_LOCKWP_Pos)) /* Assigment of value for LOCKWP in the HEFC_WPMR register */
#define HEFC_WPMR_ERASEWP_Pos                 _UINT32_(3)                                          /* (HEFC_WPMR) Page, Sector and Plane Write Protection Position */
#define HEFC_WPMR_ERASEWP_Msk                 (_UINT32_(0x1) << HEFC_WPMR_ERASEWP_Pos)             /* (HEFC_WPMR) Page, Sector and Plane Write Protection Mask */
#define HEFC_WPMR_ERASEWP(value)              (HEFC_WPMR_ERASEWP_Msk & (_UINT32_(value) << HEFC_WPMR_ERASEWP_Pos)) /* Assigment of value for ERASEWP in the HEFC_WPMR register */
#define HEFC_WPMR_USER_Pos                    _UINT32_(4)                                          /* (HEFC_WPMR) User Signature Write Protection Position */
#define HEFC_WPMR_USER_Msk                    (_UINT32_(0x1) << HEFC_WPMR_USER_Pos)                /* (HEFC_WPMR) User Signature Write Protection Mask */
#define HEFC_WPMR_USER(value)                 (HEFC_WPMR_USER_Msk & (_UINT32_(value) << HEFC_WPMR_USER_Pos)) /* Assigment of value for USER in the HEFC_WPMR register */
#define HEFC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (HEFC_WPMR) Write Protection Key Position */
#define HEFC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << HEFC_WPMR_WPKEY_Pos)          /* (HEFC_WPMR) Write Protection Key Mask */
#define HEFC_WPMR_WPKEY(value)                (HEFC_WPMR_WPKEY_Msk & (_UINT32_(value) << HEFC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the HEFC_WPMR register */
#define   HEFC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x454643)                                   /* (HEFC_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define HEFC_WPMR_WPKEY_PASSWD                (HEFC_WPMR_WPKEY_PASSWD_Val << HEFC_WPMR_WPKEY_Pos)  /* (HEFC_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define HEFC_WPMR_Msk                         _UINT32_(0xFFFFFF1F)                                 /* (HEFC_WPMR) Register Mask  */


/* -------- HEFC_HECC_CR : (HEFC Offset: 0x100) (R/W 32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) -------- */
#define HEFC_HECC_CR_ENABLE_Pos               _UINT32_(0)                                          /* (HEFC_HECC_CR) ECC protection enable Position */
#define HEFC_HECC_CR_ENABLE_Msk               (_UINT32_(0x1) << HEFC_HECC_CR_ENABLE_Pos)           /* (HEFC_HECC_CR) ECC protection enable Mask */
#define HEFC_HECC_CR_ENABLE(value)            (HEFC_HECC_CR_ENABLE_Msk & (_UINT32_(value) << HEFC_HECC_CR_ENABLE_Pos)) /* Assigment of value for ENABLE in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_TEST_MODE_RD_Pos         _UINT32_(1)                                          /* (HEFC_HECC_CR) test mode of ECC protection - read mode Position */
#define HEFC_HECC_CR_TEST_MODE_RD_Msk         (_UINT32_(0x1) << HEFC_HECC_CR_TEST_MODE_RD_Pos)     /* (HEFC_HECC_CR) test mode of ECC protection - read mode Mask */
#define HEFC_HECC_CR_TEST_MODE_RD(value)      (HEFC_HECC_CR_TEST_MODE_RD_Msk & (_UINT32_(value) << HEFC_HECC_CR_TEST_MODE_RD_Pos)) /* Assigment of value for TEST_MODE_RD in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_TEST_MODE_WR_Pos         _UINT32_(2)                                          /* (HEFC_HECC_CR) test mode of ECC protection - write mode Position */
#define HEFC_HECC_CR_TEST_MODE_WR_Msk         (_UINT32_(0x1) << HEFC_HECC_CR_TEST_MODE_WR_Pos)     /* (HEFC_HECC_CR) test mode of ECC protection - write mode Mask */
#define HEFC_HECC_CR_TEST_MODE_WR(value)      (HEFC_HECC_CR_TEST_MODE_WR_Msk & (_UINT32_(value) << HEFC_HECC_CR_TEST_MODE_WR_Pos)) /* Assigment of value for TEST_MODE_WR in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_RST_FIX_CPT_Pos          _UINT32_(4)                                          /* (HEFC_HECC_CR) reset the fixable error counter Position */
#define HEFC_HECC_CR_RST_FIX_CPT_Msk          (_UINT32_(0x1) << HEFC_HECC_CR_RST_FIX_CPT_Pos)      /* (HEFC_HECC_CR) reset the fixable error counter Mask */
#define HEFC_HECC_CR_RST_FIX_CPT(value)       (HEFC_HECC_CR_RST_FIX_CPT_Msk & (_UINT32_(value) << HEFC_HECC_CR_RST_FIX_CPT_Pos)) /* Assigment of value for RST_FIX_CPT in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_RST_NOFIX_CPT_Pos        _UINT32_(5)                                          /* (HEFC_HECC_CR) reset the un-fixable error counter Position */
#define HEFC_HECC_CR_RST_NOFIX_CPT_Msk        (_UINT32_(0x1) << HEFC_HECC_CR_RST_NOFIX_CPT_Pos)    /* (HEFC_HECC_CR) reset the un-fixable error counter Mask */
#define HEFC_HECC_CR_RST_NOFIX_CPT(value)     (HEFC_HECC_CR_RST_NOFIX_CPT_Msk & (_UINT32_(value) << HEFC_HECC_CR_RST_NOFIX_CPT_Pos)) /* Assigment of value for RST_NOFIX_CPT in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_ECC12_ENABLE_Pos         _UINT32_(6)                                          /* (HEFC_HECC_CR) BCH ECC enable Position */
#define HEFC_HECC_CR_ECC12_ENABLE_Msk         (_UINT32_(0x1) << HEFC_HECC_CR_ECC12_ENABLE_Pos)     /* (HEFC_HECC_CR) BCH ECC enable Mask */
#define HEFC_HECC_CR_ECC12_ENABLE(value)      (HEFC_HECC_CR_ECC12_ENABLE_Msk & (_UINT32_(value) << HEFC_HECC_CR_ECC12_ENABLE_Pos)) /* Assigment of value for ECC12_ENABLE in the HEFC_HECC_CR register */
#define HEFC_HECC_CR_Msk                      _UINT32_(0x00000077)                                 /* (HEFC_HECC_CR) Register Mask  */


/* -------- HEFC_HECC_TESTCB : (HEFC Offset: 0x140) (R/W 32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) -------- */
#define HEFC_HECC_TESTCB_TCB_Pos              _UINT32_(0)                                          /* (HEFC_HECC_TESTCB) test check bit (16 bit) Position */
#define HEFC_HECC_TESTCB_TCB_Msk              (_UINT32_(0xFFFF) << HEFC_HECC_TESTCB_TCB_Pos)       /* (HEFC_HECC_TESTCB) test check bit (16 bit) Mask */
#define HEFC_HECC_TESTCB_TCB(value)           (HEFC_HECC_TESTCB_TCB_Msk & (_UINT32_(value) << HEFC_HECC_TESTCB_TCB_Pos)) /* Assigment of value for TCB in the HEFC_HECC_TESTCB register */
#define HEFC_HECC_TESTCB_Msk                  _UINT32_(0x0000FFFF)                                 /* (HEFC_HECC_TESTCB) Register Mask  */


/* -------- HEFC_HECC_SR : (HEFC Offset: 0x180) ( R/ 32) HECC Status register -------- */
#define HEFC_HECC_SR_MEM_FIX_Pos              _UINT32_(0)                                          /* (HEFC_HECC_SR) Fixable error status Position */
#define HEFC_HECC_SR_MEM_FIX_Msk              (_UINT32_(0x1) << HEFC_HECC_SR_MEM_FIX_Pos)          /* (HEFC_HECC_SR) Fixable error status Mask */
#define HEFC_HECC_SR_MEM_FIX(value)           (HEFC_HECC_SR_MEM_FIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_CPT_FIX_Pos              _UINT32_(2)                                          /* (HEFC_HECC_SR) 5 bits counter Position */
#define HEFC_HECC_SR_CPT_FIX_Msk              (_UINT32_(0x1F) << HEFC_HECC_SR_CPT_FIX_Pos)         /* (HEFC_HECC_SR) 5 bits counter Mask */
#define HEFC_HECC_SR_CPT_FIX(value)           (HEFC_HECC_SR_CPT_FIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_CPT_FIX_Pos)) /* Assigment of value for CPT_FIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_OVER_FIX_Pos             _UINT32_(7)                                          /* (HEFC_HECC_SR) counter overflow Position */
#define HEFC_HECC_SR_OVER_FIX_Msk             (_UINT32_(0x1) << HEFC_HECC_SR_OVER_FIX_Pos)         /* (HEFC_HECC_SR) counter overflow Mask */
#define HEFC_HECC_SR_OVER_FIX(value)          (HEFC_HECC_SR_OVER_FIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_OVER_FIX_Pos)) /* Assigment of value for OVER_FIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_MEM_NOFIX_Pos            _UINT32_(8)                                          /* (HEFC_HECC_SR) Un-fixable error status Position */
#define HEFC_HECC_SR_MEM_NOFIX_Msk            (_UINT32_(0x1) << HEFC_HECC_SR_MEM_NOFIX_Pos)        /* (HEFC_HECC_SR) Un-fixable error status Mask */
#define HEFC_HECC_SR_MEM_NOFIX(value)         (HEFC_HECC_SR_MEM_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_CPT_NOFIX_Pos            _UINT32_(10)                                         /* (HEFC_HECC_SR) 5 bits counter Position */
#define HEFC_HECC_SR_CPT_NOFIX_Msk            (_UINT32_(0x1F) << HEFC_HECC_SR_CPT_NOFIX_Pos)       /* (HEFC_HECC_SR) 5 bits counter Mask */
#define HEFC_HECC_SR_CPT_NOFIX(value)         (HEFC_HECC_SR_CPT_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_CPT_NOFIX_Pos)) /* Assigment of value for CPT_NOFIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_OVER_NOFIX_Pos           _UINT32_(15)                                         /* (HEFC_HECC_SR) counter overflow Position */
#define HEFC_HECC_SR_OVER_NOFIX_Msk           (_UINT32_(0x1) << HEFC_HECC_SR_OVER_NOFIX_Pos)       /* (HEFC_HECC_SR) counter overflow Mask */
#define HEFC_HECC_SR_OVER_NOFIX(value)        (HEFC_HECC_SR_OVER_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_SR_OVER_NOFIX_Pos)) /* Assigment of value for OVER_NOFIX in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_HES_Pos                  _UINT32_(24)                                         /* (HEFC_HECC_SR) Hardware Error Size Position */
#define HEFC_HECC_SR_HES_Msk                  (_UINT32_(0x7) << HEFC_HECC_SR_HES_Pos)              /* (HEFC_HECC_SR) Hardware Error Size Mask */
#define HEFC_HECC_SR_HES(value)               (HEFC_HECC_SR_HES_Msk & (_UINT32_(value) << HEFC_HECC_SR_HES_Pos)) /* Assigment of value for HES in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_TYPE_Pos                 _UINT32_(27)                                         /* (HEFC_HECC_SR) write or read access Position */
#define HEFC_HECC_SR_TYPE_Msk                 (_UINT32_(0x1) << HEFC_HECC_SR_TYPE_Pos)             /* (HEFC_HECC_SR) write or read access Mask */
#define HEFC_HECC_SR_TYPE(value)              (HEFC_HECC_SR_TYPE_Msk & (_UINT32_(value) << HEFC_HECC_SR_TYPE_Pos)) /* Assigment of value for TYPE in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_MEM_ID_Pos               _UINT32_(28)                                         /* (HEFC_HECC_SR) memory identification number Position */
#define HEFC_HECC_SR_MEM_ID_Msk               (_UINT32_(0x3) << HEFC_HECC_SR_MEM_ID_Pos)           /* (HEFC_HECC_SR) memory identification number Mask */
#define HEFC_HECC_SR_MEM_ID(value)            (HEFC_HECC_SR_MEM_ID_Msk & (_UINT32_(value) << HEFC_HECC_SR_MEM_ID_Pos)) /* Assigment of value for MEM_ID in the HEFC_HECC_SR register */
#define HEFC_HECC_SR_Msk                      _UINT32_(0x3F00FDFD)                                 /* (HEFC_HECC_SR) Register Mask  */


/* -------- HEFC_HECC_IER : (HEFC Offset: 0x184) ( /W 32) HECC Interrupt Enable Register -------- */
#define HEFC_HECC_IER_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEFC_HECC_IER) Fixable error Position */
#define HEFC_HECC_IER_MEM_FIX_Msk             (_UINT32_(0x1) << HEFC_HECC_IER_MEM_FIX_Pos)         /* (HEFC_HECC_IER) Fixable error Mask */
#define HEFC_HECC_IER_MEM_FIX(value)          (HEFC_HECC_IER_MEM_FIX_Msk & (_UINT32_(value) << HEFC_HECC_IER_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEFC_HECC_IER register */
#define HEFC_HECC_IER_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEFC_HECC_IER) Un-fixable error Position */
#define HEFC_HECC_IER_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEFC_HECC_IER_MEM_NOFIX_Pos)       /* (HEFC_HECC_IER) Un-fixable error Mask */
#define HEFC_HECC_IER_MEM_NOFIX(value)        (HEFC_HECC_IER_MEM_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_IER_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEFC_HECC_IER register */
#define HEFC_HECC_IER_Msk                     _UINT32_(0x00000003)                                 /* (HEFC_HECC_IER) Register Mask  */


