Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hefc.h
/* -------- HEFC_HECC_IDR : (HEFC Offset: 0x188) ( /W 32) HECC Interrupt Disable Register -------- */
#define HEFC_HECC_IDR_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEFC_HECC_IDR) fixable error Position */
#define HEFC_HECC_IDR_MEM_FIX_Msk             (_UINT32_(0x1) << HEFC_HECC_IDR_MEM_FIX_Pos)         /* (HEFC_HECC_IDR) fixable error Mask */
#define HEFC_HECC_IDR_MEM_FIX(value)          (HEFC_HECC_IDR_MEM_FIX_Msk & (_UINT32_(value) << HEFC_HECC_IDR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEFC_HECC_IDR register */
#define HEFC_HECC_IDR_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEFC_HECC_IDR) un-fixable error Position */
#define HEFC_HECC_IDR_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEFC_HECC_IDR_MEM_NOFIX_Pos)       /* (HEFC_HECC_IDR) un-fixable error Mask */
#define HEFC_HECC_IDR_MEM_NOFIX(value)        (HEFC_HECC_IDR_MEM_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_IDR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEFC_HECC_IDR register */
#define HEFC_HECC_IDR_Msk                     _UINT32_(0x00000003)                                 /* (HEFC_HECC_IDR) Register Mask  */


/* -------- HEFC_HECC_IMR : (HEFC Offset: 0x18C) ( R/ 32) HECC Interrupt Mask Register -------- */
#define HEFC_HECC_IMR_MEM_FIX_Pos             _UINT32_(0)                                          /* (HEFC_HECC_IMR) fixable error Position */
#define HEFC_HECC_IMR_MEM_FIX_Msk             (_UINT32_(0x1) << HEFC_HECC_IMR_MEM_FIX_Pos)         /* (HEFC_HECC_IMR) fixable error Mask */
#define HEFC_HECC_IMR_MEM_FIX(value)          (HEFC_HECC_IMR_MEM_FIX_Msk & (_UINT32_(value) << HEFC_HECC_IMR_MEM_FIX_Pos)) /* Assigment of value for MEM_FIX in the HEFC_HECC_IMR register */
#define HEFC_HECC_IMR_MEM_NOFIX_Pos           _UINT32_(1)                                          /* (HEFC_HECC_IMR) un-fixable error Position */
#define HEFC_HECC_IMR_MEM_NOFIX_Msk           (_UINT32_(0x1) << HEFC_HECC_IMR_MEM_NOFIX_Pos)       /* (HEFC_HECC_IMR) un-fixable error Mask */
#define HEFC_HECC_IMR_MEM_NOFIX(value)        (HEFC_HECC_IMR_MEM_NOFIX_Msk & (_UINT32_(value) << HEFC_HECC_IMR_MEM_NOFIX_Pos)) /* Assigment of value for MEM_NOFIX in the HEFC_HECC_IMR register */
#define HEFC_HECC_IMR_Msk                     _UINT32_(0x00000003)                                 /* (HEFC_HECC_IMR) Register Mask  */


/* -------- HEFC_HECC_FAILAR : (HEFC Offset: 0x190) ( R/ 32) HECC Fail address register -------- */
#define HEFC_HECC_FAILAR_ADDRESS_Pos          _UINT32_(0)                                          /* (HEFC_HECC_FAILAR) address of the error detected Position */
#define HEFC_HECC_FAILAR_ADDRESS_Msk          (_UINT32_(0xFFFFFFFF) << HEFC_HECC_FAILAR_ADDRESS_Pos) /* (HEFC_HECC_FAILAR) address of the error detected Mask */
#define HEFC_HECC_FAILAR_ADDRESS(value)       (HEFC_HECC_FAILAR_ADDRESS_Msk & (_UINT32_(value) << HEFC_HECC_FAILAR_ADDRESS_Pos)) /* Assigment of value for ADDRESS in the HEFC_HECC_FAILAR register */
#define HEFC_HECC_FAILAR_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (HEFC_HECC_FAILAR) Register Mask  */


/* -------- HEFC_HECC_FAILDR : (HEFC Offset: 0x194) ( R/ 32) HECC Fail data register -------- */
#define HEFC_HECC_FAILDR_DATA_Pos             _UINT32_(0)                                          /* (HEFC_HECC_FAILDR) data of the error detected Position */
#define HEFC_HECC_FAILDR_DATA_Msk             (_UINT32_(0xFFFFFFFF) << HEFC_HECC_FAILDR_DATA_Pos)  /* (HEFC_HECC_FAILDR) data of the error detected Mask */
#define HEFC_HECC_FAILDR_DATA(value)          (HEFC_HECC_FAILDR_DATA_Msk & (_UINT32_(value) << HEFC_HECC_FAILDR_DATA_Pos)) /* Assigment of value for DATA in the HEFC_HECC_FAILDR register */
#define HEFC_HECC_FAILDR_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (HEFC_HECC_FAILDR) Register Mask  */


/* -------- HEFC_GPNVM_TRIM_RC : (HEFC Offset: 0x00) (R/W 32) HEFC GPNVM word RC trim CRC -------- */
#define HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC_Pos    _UINT32_(0)                                          /* (HEFC_GPNVM_TRIM_RC) RC Trim CRC Position */
#define HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC_Msk    (_UINT32_(0xFFFFFFFF) << HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC_Pos) /* (HEFC_GPNVM_TRIM_RC) RC Trim CRC Mask */
#define HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC(value) (HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC_Msk & (_UINT32_(value) << HEFC_GPNVM_TRIM_RC_RC_TRIM_CRC_Pos)) /* Assigment of value for RC_TRIM_CRC in the HEFC_GPNVM_TRIM_RC register */
#define HEFC_GPNVM_TRIM_RC_Msk                _UINT32_(0xFFFFFFFF)                                 /* (HEFC_GPNVM_TRIM_RC) Register Mask  */


/* -------- HEFC_GPNVM_RC_TRIM : (HEFC Offset: 0x04) (R/W 32) HEFC GPNVM word RC trim -------- */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM0_Pos      _UINT32_(0)                                          /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 0 Position */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM0_Msk      (_UINT32_(0x3) << HEFC_GPNVM_RC_TRIM_RC_TTRIM0_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 0 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM0(value)   (HEFC_GPNVM_RC_TRIM_RC_TTRIM0_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_TTRIM0_Pos)) /* Assigment of value for RC_TTRIM0 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM0_Pos      _UINT32_(2)                                          /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 0 Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM0_Msk      (_UINT32_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM0_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 0 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM0(value)   (HEFC_GPNVM_RC_TRIM_RC_FTRIM0_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM0_Pos)) /* Assigment of value for RC_FTRIM0 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM1_Pos      _UINT32_(5)                                          /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 1 Position */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM1_Msk      (_UINT32_(0x3) << HEFC_GPNVM_RC_TRIM_RC_TTRIM1_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 1 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM1(value)   (HEFC_GPNVM_RC_TRIM_RC_TTRIM1_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_TTRIM1_Pos)) /* Assigment of value for RC_TTRIM1 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM1_Pos      _UINT32_(7)                                          /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 1 Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM1_Msk      (_UINT32_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM1_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 1 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM1(value)   (HEFC_GPNVM_RC_TRIM_RC_FTRIM1_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM1_Pos)) /* Assigment of value for RC_FTRIM1 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM2_Pos      _UINT32_(10)                                         /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 2 Position */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM2_Msk      (_UINT32_(0x3) << HEFC_GPNVM_RC_TRIM_RC_TTRIM2_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Temperature Trim 2 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_TTRIM2(value)   (HEFC_GPNVM_RC_TRIM_RC_TTRIM2_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_TTRIM2_Pos)) /* Assigment of value for RC_TTRIM2 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM2_Pos      _UINT32_(12)                                         /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 2 Position */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM2_Msk      (_UINT32_(0x7) << HEFC_GPNVM_RC_TRIM_RC_FTRIM2_Pos)  /* (HEFC_GPNVM_RC_TRIM) RC Frequency Trim 2 Mask */
#define HEFC_GPNVM_RC_TRIM_RC_FTRIM2(value)   (HEFC_GPNVM_RC_TRIM_RC_FTRIM2_Msk & (_UINT32_(value) << HEFC_GPNVM_RC_TRIM_RC_FTRIM2_Pos)) /* Assigment of value for RC_FTRIM2 in the HEFC_GPNVM_RC_TRIM register */
#define HEFC_GPNVM_RC_TRIM_Msk                _UINT32_(0x00007FFF)                                 /* (HEFC_GPNVM_RC_TRIM) Register Mask  */


/* -------- HEFC_GPNVM_USR2 : (HEFC Offset: 0x04) (R/W 32) User Word 2 -------- */
#define HEFC_GPNVM_USR2_USR_WORD2_Pos         _UINT32_(0)                                          /* (HEFC_GPNVM_USR2) User Word 2 Position */
#define HEFC_GPNVM_USR2_USR_WORD2_Msk         (_UINT32_(0xFFFFFFFF) << HEFC_GPNVM_USR2_USR_WORD2_Pos) /* (HEFC_GPNVM_USR2) User Word 2 Mask */
#define HEFC_GPNVM_USR2_USR_WORD2(value)      (HEFC_GPNVM_USR2_USR_WORD2_Msk & (_UINT32_(value) << HEFC_GPNVM_USR2_USR_WORD2_Pos)) /* Assigment of value for USR_WORD2 in the HEFC_GPNVM_USR2 register */
#define HEFC_GPNVM_USR2_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (HEFC_GPNVM_USR2) Register Mask  */


/* -------- HEFC_GPNVM_USR3 : (HEFC Offset: 0x04) (R/W 32) User Word 3 -------- */
#define HEFC_GPNVM_USR3_USR_WORD3_Pos         _UINT32_(0)                                          /* (HEFC_GPNVM_USR3) User Word 3 Position */
#define HEFC_GPNVM_USR3_USR_WORD3_Msk         (_UINT32_(0xFFFFFFFF) << HEFC_GPNVM_USR3_USR_WORD3_Pos) /* (HEFC_GPNVM_USR3) User Word 3 Mask */
#define HEFC_GPNVM_USR3_USR_WORD3(value)      (HEFC_GPNVM_USR3_USR_WORD3_Msk & (_UINT32_(value) << HEFC_GPNVM_USR3_USR_WORD3_Pos)) /* Assigment of value for USR_WORD3 in the HEFC_GPNVM_USR3 register */
#define HEFC_GPNVM_USR3_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (HEFC_GPNVM_USR3) Register Mask  */


/** \brief HEFC register offsets definitions */
#define HEFC_FMR_REG_OFST              _UINT32_(0x00)      /* (HEFC_FMR) HEFC Flash Mode Register Offset */
#define HEFC_FCR_REG_OFST              _UINT32_(0x04)      /* (HEFC_FCR) HEFC Flash Command Register Offset */
#define HEFC_FSR_REG_OFST              _UINT32_(0x08)      /* (HEFC_FSR) HEFC Flash Status Register Offset */
#define HEFC_FRR_REG_OFST              _UINT32_(0x0C)      /* (HEFC_FRR) HEFC Flash Result Register Offset */
#define HEFC_FPMR_REG_OFST             _UINT32_(0x40)      /* (HEFC_FPMR) HEFC Flash Power Management Register Offset */
#define HEFC_WPMR_REG_OFST             _UINT32_(0xE4)      /* (HEFC_WPMR) Write Protection Mode Register Offset */
#define HEFC_HECC_CR_REG_OFST          _UINT32_(0x100)     /* (HEFC_HECC_CR) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR0_REG_OFST         _UINT32_(0x100)     /* (HEFC_HECC_CR0) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR1_REG_OFST         _UINT32_(0x104)     /* (HEFC_HECC_CR1) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR2_REG_OFST         _UINT32_(0x108)     /* (HEFC_HECC_CR2) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR3_REG_OFST         _UINT32_(0x10C)     /* (HEFC_HECC_CR3) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR4_REG_OFST         _UINT32_(0x110)     /* (HEFC_HECC_CR4) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR5_REG_OFST         _UINT32_(0x114)     /* (HEFC_HECC_CR5) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR6_REG_OFST         _UINT32_(0x118)     /* (HEFC_HECC_CR6) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR7_REG_OFST         _UINT32_(0x11C)     /* (HEFC_HECC_CR7) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR8_REG_OFST         _UINT32_(0x120)     /* (HEFC_HECC_CR8) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR9_REG_OFST         _UINT32_(0x124)     /* (HEFC_HECC_CR9) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR10_REG_OFST        _UINT32_(0x128)     /* (HEFC_HECC_CR10) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR11_REG_OFST        _UINT32_(0x12C)     /* (HEFC_HECC_CR11) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR12_REG_OFST        _UINT32_(0x130)     /* (HEFC_HECC_CR12) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR13_REG_OFST        _UINT32_(0x134)     /* (HEFC_HECC_CR13) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR14_REG_OFST        _UINT32_(0x138)     /* (HEFC_HECC_CR14) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_CR15_REG_OFST        _UINT32_(0x13C)     /* (HEFC_HECC_CR15) HECC Control Register ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB_REG_OFST      _UINT32_(0x140)     /* (HEFC_HECC_TESTCB) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB0_REG_OFST     _UINT32_(0x140)     /* (HEFC_HECC_TESTCB0) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB1_REG_OFST     _UINT32_(0x144)     /* (HEFC_HECC_TESTCB1) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB2_REG_OFST     _UINT32_(0x148)     /* (HEFC_HECC_TESTCB2) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB3_REG_OFST     _UINT32_(0x14C)     /* (HEFC_HECC_TESTCB3) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB4_REG_OFST     _UINT32_(0x150)     /* (HEFC_HECC_TESTCB4) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB5_REG_OFST     _UINT32_(0x154)     /* (HEFC_HECC_TESTCB5) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB6_REG_OFST     _UINT32_(0x158)     /* (HEFC_HECC_TESTCB6) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB7_REG_OFST     _UINT32_(0x15C)     /* (HEFC_HECC_TESTCB7) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB8_REG_OFST     _UINT32_(0x160)     /* (HEFC_HECC_TESTCB8) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB9_REG_OFST     _UINT32_(0x164)     /* (HEFC_HECC_TESTCB9) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB10_REG_OFST    _UINT32_(0x168)     /* (HEFC_HECC_TESTCB10) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB11_REG_OFST    _UINT32_(0x16C)     /* (HEFC_HECC_TESTCB11) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB12_REG_OFST    _UINT32_(0x170)     /* (HEFC_HECC_TESTCB12) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB13_REG_OFST    _UINT32_(0x174)     /* (HEFC_HECC_TESTCB13) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB14_REG_OFST    _UINT32_(0x178)     /* (HEFC_HECC_TESTCB14) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_TESTCB15_REG_OFST    _UINT32_(0x17C)     /* (HEFC_HECC_TESTCB15) HECC Test mode ChannelNumbers (ChannelNumbers = 0) Offset */
#define HEFC_HECC_SR_REG_OFST          _UINT32_(0x180)     /* (HEFC_HECC_SR) HECC Status register Offset */
#define HEFC_HECC_IER_REG_OFST         _UINT32_(0x184)     /* (HEFC_HECC_IER) HECC Interrupt Enable Register Offset */
#define HEFC_HECC_IDR_REG_OFST         _UINT32_(0x188)     /* (HEFC_HECC_IDR) HECC Interrupt Disable Register Offset */
#define HEFC_HECC_IMR_REG_OFST         _UINT32_(0x18C)     /* (HEFC_HECC_IMR) HECC Interrupt Mask Register Offset */
#define HEFC_HECC_FAILAR_REG_OFST      _UINT32_(0x190)     /* (HEFC_HECC_FAILAR) HECC Fail address register Offset */
#define HEFC_HECC_FAILDR_REG_OFST      _UINT32_(0x194)     /* (HEFC_HECC_FAILDR) HECC Fail data register Offset */
#define HEFC_GPNVM_TRIM_RC_REG_OFST    _UINT32_(0x00)      /* (HEFC_GPNVM_TRIM_RC) HEFC GPNVM word RC trim CRC Offset */
#define HEFC_GPNVM_RC_TRIM_REG_OFST    _UINT32_(0x04)      /* (HEFC_GPNVM_RC_TRIM) HEFC GPNVM word RC trim Offset */
#define HEFC_GPNVM_USR2_REG_OFST       _UINT32_(0x04)      /* (HEFC_GPNVM_USR2) User Word 2 Offset */
#define HEFC_GPNVM_USR3_REG_OFST       _UINT32_(0x04)      /* (HEFC_GPNVM_USR3) User Word 3 Offset */

