Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_pll_estimator_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/hefc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HEFC register API structure */
typedef struct
{
  __IO  uint32_t                       HEFC_FMR;           /**< Offset: 0x00 (R/W  32) HEFC Flash Mode Register */
  __O   uint32_t                       HEFC_FCR;           /**< Offset: 0x04 ( /W  32) HEFC Flash Command Register */
  __I   uint32_t                       HEFC_FSR;           /**< Offset: 0x08 (R/   32) HEFC Flash Status Register */
  __I   uint32_t                       HEFC_FRR;           /**< Offset: 0x0C (R/   32) HEFC Flash Result Register */
  __I   uint8_t                        Reserved1[0x30];
  __IO  uint32_t                       HEFC_FPMR;          /**< Offset: 0x40 (R/W  32) HEFC Flash Power Management Register */
  __I   uint8_t                        Reserved2[0xA0];
  __IO  uint32_t                       HEFC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved3[0x18];
  __IO  uint32_t                       HEFC_HECC_CR[16];   /**< Offset: 0x100 (R/W  32) HECC Control Register ChannelNumbers (ChannelNumbers = 0) */
  __IO  uint32_t                       HEFC_HECC_TESTCB[16]; /**< Offset: 0x140 (R/W  32) HECC Test mode ChannelNumbers (ChannelNumbers = 0) */
  __I   uint32_t                       HEFC_HECC_SR;       /**< Offset: 0x180 (R/   32) HECC Status register */
  __O   uint32_t                       HEFC_HECC_IER;      /**< Offset: 0x184 ( /W  32) HECC Interrupt Enable Register */
  __O   uint32_t                       HEFC_HECC_IDR;      /**< Offset: 0x188 ( /W  32) HECC Interrupt Disable Register */
  __I   uint32_t                       HEFC_HECC_IMR;      /**< Offset: 0x18C (R/   32) HECC Interrupt Mask Register */
  __I   uint32_t                       HEFC_HECC_FAILAR;   /**< Offset: 0x190 (R/   32) HECC Fail address register */
  __I   uint32_t                       HEFC_HECC_FAILDR;   /**< Offset: 0x194 (R/   32) HECC Fail data register */
} hefc_registers_t;

/** \brief GPNVMBITS register API structure */
typedef struct
{  /* GPNVM Bits */
  __IO  uint32_t                       HEFC_GPNVM_TRIM_RC; /**< Offset: 0x00 (R/W  32) HEFC GPNVM word RC trim CRC */
  union
  {
      __IO  uint32_t                       HEFC_GPNVM_USR2;    /**< Offset: 0x04 (R/W  32) User Word 2 */
      __IO  uint32_t                       HEFC_GPNVM_USR3;    /**< Offset: 0x04 (R/W  32) User Word 3 */
      __IO  uint32_t                       HEFC_GPNVM_RC_TRIM; /**< Offset: 0x04 (R/W  32) HEFC GPNVM word RC trim */
  };
} hefc_gpnvmbits_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH707_HEFC_COMPONENT_H_ */
